# YVector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanarFace..::..YVector Property
PlanarFace Class See Also
---
The Y-vector of the planar face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ YVector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YVector As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YVector {
	XYZ^ get ();
}
```

# Remarks
Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector depending upon how Revit has structured this particular face.
# See Also
PlanarFace Class
Autodesk.Revit.DB Namespace